Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOption Property
 A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOption { get; }
Public Shared ReadOnly Property ConfusingSweepByElementsInAnotherDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInAnotherDesignOption {
	FailureDefinitionId^ get ();
}
static member ConfusingSweepByElementsInAnotherDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace